#ifndef _GSM_DRIVER_API_H_
#define _GSM_DRIVER_API_H_
#include"GsmDriverTypeDef.h"
/***************************************************************
			电话处于通话状态?
				是,返回TRUE,
				否,范围FALSE, 
****************************************************************/
GsmTpBool GsmApiPhoneStIsSpking(void); 

/***************************************************************
			电话处于等待接通状态?
				是,返回TRUE,
				否,范围FALSE, 
****************************************************************/
GsmTpBool GsmApiPhoneStIsLink(void); 


/***************************************************************
			电话处于响铃状态?
				是,返回TRUE,
				否,范围FALSE, 
****************************************************************/
GsmTpBool GsmApiPhoneStIsRing(void); 

/*******************************************************************
			电话处于空闲状态?
				是,返回TRUE,
				否,范围FALSE, 
********************************************************************/
GsmTpBool GsmPhoneIsIdle(void); 


/***************************************************************
			电话属于外拨电话
				是,返回TRUE,
				否,范围FALSE, 
****************************************************************/
GsmTpBool GsmApiPhoneIsDailOut(void); 

/*************************************************************
	正在进行的通话是平台通话或者LCD通话
	为LCD屏显示通话所做
*************************************************************/
GsmTpBool GsmApiPhoneIsPltOrLcd(void); 


/*************************************************************
作者:李宏展
函数名:	获取当前电话号码,
函数功能:	获得当前打电话的电话号码
					或者当前来电号码
输入:号码和号码长度输出的指针
输出:	
		成功返回TRUE,
		失败返回FALSE,
	
		成功通过指针输出号码及内容
注意事项:传入空间要足够
*************************************************************/
GsmTpBool GsmApiPhoneGetCurNum(GsmTpU8 *pu8Dat, GsmTpU8 *pu8Len); 


/*************************************************************
作者:李宏展
函数名:	电话接听请求
函数功能:	来电响铃时请求接听
输入:无
输出:无
*************************************************************/
void app_gsm_PhoneReqPickUp(void); 

/*************************************************************
作者:李宏展
函数名:	电话挂机请求
函数功能:	电话请求挂断
输入:无
输出:无
*************************************************************/
void app_gsm_PhoneReqHangUp(void); 
/*************************************************************
作者:李宏展
函数名:	拨打电话号码请求
函数功能:	依据给定号码拨打电话
输入:号码和拨打属性,目前可取值范围
			PHONE_ATTRI_NULL, 
			PHONE_ATTRI_LCD, 
			PHONE_ATTRI_HAND, 
			PHONE_ATTRI_PLTF, 
			PHONE_ATTRI_LISTEN, 

输出:	
		成功返回TRUE,
		失败返回FALSE,
注意:无
*************************************************************/
GsmTpU8 app_gsm_PhoneNumReqToDial(GsmTpU8 *num, GsmTpU8 attri); 
/*************************************************************
作者:李宏展
函数名:	语音通道切换请求
函数功能:	通话时切换语音通道
输入:无
输出:	
		成功返回TRUE,
		失败返回FALSE,
注意:通话中或者等待接通方可生效
*************************************************************/
GsmTpU8 app_gsm_PhoneChlReqSwitch(void); 
/*************************************************************
作者:李宏展
函数名:	电话声音调整请求
函数功能:	通话时调整音量大小
输入:
			GSM_PHONE_VOL_UP, 音量调高
			GSM_PHONE_VOL_DW, 音量调低

输出:	
		成功返回TRUE,
		失败返回FALSE,
注意:通话中方可生效
*************************************************************/
GsmTpU8 app_gsm_PhoneVolReqAdj(enum GsmPhoneVolOprEn VolAdjOpr); 
/*************************************************************
作者:李宏展
函数名:	双音多频拨号请求
函数功能:	通话时双音多频拨号发送
输入:拨号内容
输出:	
		成功返回TRUE,
		失败返回FALSE,
注意:通话中方可生效
*************************************************************/
GsmTpU8 app_gsm_PhoneDTMFReqToSend(GsmTpU8 dtmf); 
/*************************************************************
作者:李宏展
函数名:	GSM模块复位请求
函数功能:	复位GSM模块
输入:无
输出:	无
注意:无
*************************************************************/
void GsmModRstReq(void); 
/*************************************************************
作者:李宏展
函数名:	GPRS复位请求
函数功能:	复位GPRS功能
输入:无
输出:	无
注意:无
*************************************************************/
void GsmGprsRstReq(void); 
/*************************************************************
作者:李宏展
函数名:	GSM 网络及模块状态准备好(除GPRS外功能正常)
函数功能:	GSM网络及模块配置状态获取
输入:无
输出:	GSM网络及模块配置OK,返回TRUE,否则FALSE
注意:无
*************************************************************/
GsmTpBool GsmModGsmIsOk(void); 
/*************************************************************
作者:李宏展
2015-5-13 15:10:16
函数名:	GPRS 网络状态准备好
函数功能:	GPRS 网络状态获取
输入:无
输出:	GPRS 网络状态OK,返回TRUE,否则FALSE
注意:无
*************************************************************/
GsmTpBool GsmGprsIsOk(void); 
/*************************************************************
作者:李宏展
2015-5-13 15:10:16
函数名:	GPRS 网络断开
函数功能:	设定GPRS网络断开
输入:无
输出:	无
注意:无
*************************************************************/
void GsmGprsNgSet(void); 
/*************************************************************
作者:李宏展
2015-5-13 15:10:16
函数名:	GSM短信发送请求
函数功能:	GSM短信发送请求
输入:依据结构体输入参数
		包含,号码,内容,数据内容,
		数据长度,发送完成回调等
输出:成功输出TRUE,否则FALSE
注意:无
*************************************************************/
GsmTpBool GsmSmsTxReq(SmsTxParaSt *pstTxPara); 
/*************************************************************
作者:李宏展
2015-5-13 15:10:16
函数名:	GSM短信发送请求(为兼容一部分老的应用接口)
函数功能:	GSM短信发送请求
输入:依据结构体输入参数
		包含,号码,内容,数据内容,
		数据长度,属性,
		pDCS无效
输出:成功输出TRUE,否则FALSE
注意:无
*************************************************************/
GsmTpU8 app_gsm_SmsMsgReqToSend(GsmTpU8 *num, 
									GsmTpU8 num_len, 
									GsmTpU8 *msg, 
									GsmTpU8 msg_len, 
									GsmTpU8 attri, 
									GsmTpU8 pDCS); 

/*************************************************************
作者:李宏展
时间:2015-5-13 15:10:16
函数名:	GSM 网络打开请求
函数功能:	打开GPRS网络
输入:网络打开时间,单位秒
输出:无
注意:无
*************************************************************/
void GsmNetOpenReq(GsmTpU16 u16TimeS); 
/*************************************************************
作者:李宏展
时间:2015-5-13 15:10:16
函数名:	GSM 网络关闭请求
函数功能:	关闭GPRS网络
输入:(目前无效)网络关闭延时,单位秒,延时后关闭
输出:无
注意:无
*************************************************************/
void GsmNetCloseReq(GsmTpU16 u16TimeS); 
/*************************************************************
作者:李宏展
时间:2015-5-14 09:44:54
函数名:	获取GSM 网络信号强度
函数功能:	获取GSM 网络信号强度
输入:无
输出:网络信号强度,(0 ~ 31)
注意:无
*************************************************************/
GsmTpU8 GsmGetCsq(void); 
/*************************************************************
作者:李宏展
时间:2015-5-14 09:44:54
函数名:	获取GPRS Socket 链接参数
函数功能:	获取GPRS Socket 链接参数
输入:要获取的Socket Id, 见枚举定义,输出数据载体指针
输出:通过指针输出链接参数,见结构体定义
注意:无
*************************************************************/
void GsmGetSocketLinkPara(IpDatSrcEn enSckId, GsmAtUseSocketParaSt *pstDstPara); 

/*************************************************************
作者:李宏展
时间:2015-5-14 10:45:06
函数名:	GSM模块录音请求
函数功能:	启动GSM模块录音
输入:boIsStartFlg:开始/停止录音
		stPara://录音时间,采集频率,录音完成后回调等
输出:成功TRUE,失败FALSE
注意:无
*************************************************************/
GsmTpBool GsmAudioRecordReq(GsmTpBool boIsStartFlg, 
						struct GsmAudioRecordReqParaSt stPara); 

/*************************************************************
作者:李宏展
时间:2015-5-14 09:44:54
函数名:	获取电话属性(手柄 or LCD)
函数功能:	获取电话属性(手柄 or LCD)
输入:无
输出:电话属性,见结构体定义
注意:无
*************************************************************/
PhoneAttriEn GsmGetPhoneAttr(void); 

#endif


