/*
************************************************************************************************************************
* 								航天无线通信技术开发有限公司
------------------------------------------------------------------------------------------------------------------------
* 文件模块: ESP8266任务程序
* 开发时间: 2016.05.04
* 软件版本: V1.0.3
************************************************************************************************************************
*/
#ifndef _WIFI_USR_CONFIG_H_
#define _WIFI_USR_CONFIG_H_

#define AT_WIFI_AP_NUM	 3  // 也是使用中需要的WIFI 热点数目
#define WIFI_CMD_TIMEOUT_CNT  8 // 指令超时时限，单位: 秒
#define CMD_QUEUE_LEN_MAX		10 // 指令列表最多支持的指令数
//扫描热点返回的最大热点数,注意,修改可能要对应修改缓冲区大小
#define WIFI_SCAN_AP_LIST_ADDR_MAX_NUM		8
#endif

